; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	spectrograph1 - mode
	infrared5 - mode
	infrared6 - mode
	image3 - mode
	infrared7 - mode
	image4 - mode
	spectrograph2 - mode
	GroundStation5 - direction
	Star6 - direction
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Star2 - direction
	GroundStation4 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image4)
	(supports instrument1 infrared7)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 image3)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared7)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star3)
	(supports instrument7 image3)
	(supports instrument7 infrared6)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
)
(:goal (and
	(have_image Star7 image3)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon8 infrared7)
	(have_image Planet9 spectrograph2)
	(have_image Planet9 image3)
	(have_image Star10 infrared0)
	(have_image Star11 infrared0)
	(have_image Star12 infrared5)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 10
2. (calibrate satellite3 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 0 of 10
3. (turn_to satellite3 planet9 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet9)
   goals met: 0 of 10
4. (take_image satellite3 planet9 instrument6 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 1 of 10
5. (turn_to satellite3 phenomenon8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon8)
   goals met: 1 of 10
6. (turn_to satellite2 star1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star1)
   goals met: 1 of 10
7. (turn_to satellite1 groundstation4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 10
8. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 10
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
10. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 1 of 10
11. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 1 of 10
12. (take_image satellite3 phenomenon8 instrument6 infrared7)
   added: (have_image phenomenon8 infrared7)
   goals met: 2 of 10
13. (turn_to satellite1 planet9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet9)
   goals met: 2 of 10
14. (take_image satellite1 planet9 instrument2 image3)
   added: (have_image planet9 image3)
   goals met: 3 of 10
15. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 3 of 10
16. (take_image satellite1 star12 instrument2 infrared5)
   added: (have_image star12 infrared5)
   goals met: 4 of 10
17. (turn_to satellite1 star7 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star7)
   goals met: 4 of 10
18. (take_image satellite1 star7 instrument2 image3)
   added: (have_image star7 image3)
   goals met: 5 of 10
19. (turn_to satellite2 phenomenon8 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 10
20. (take_image satellite2 phenomenon8 instrument4 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 10
21. (turn_to satellite2 star10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star10)
   goals met: 6 of 10
22. (take_image satellite2 star10 instrument4 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 10
23. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 7 of 10
24. (take_image satellite2 star11 instrument4 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 10
25. (turn_to satellite2 star7 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star7)
   goals met: 8 of 10
26. (take_image satellite2 star7 instrument4 infrared0)
   added: (have_image star7 infrared0)
   goals met: 9 of 10
27. (turn_to satellite3 star12 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star12)
   goals met: 9 of 10
28. (take_image satellite3 star12 instrument6 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 10 of 10
